{
  "basics": {
    "name": "Dustin Delatore",
    "label": "Front-end Developer/Designer",
    "picture": "",
    "email": "dustin@delatore.me",
    "phone": "(603) 767-0614",
    "website": "http://whosdustin.com",
    "summary": "Over 10 years of web design and 6 years front-end development experience. All of my attention was focused on creating the best user experience possible. Highly motivated, hard working and an ambitious leader prepared for any challenges that confront me.",
    "location": {
      "address": "2712 Broadway St",
      "postalCode": "CA 94115",
      "city": "San Francisco",
      "countryCode": "US",
      "region": "California"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "whos_dustin",
        "url": "http://twitter.com/whos_dustin"
      },
      {
        "network": "Github",
        "username": "whosdustin",
        "url": "http://github.com/whosdustin"
      }
    ]
  },
  "work": [
    {
      "company": "Bisk Education",
      "position": "Front-end/Mobile Developer",
      "website": "http://bisk.com",
      "startDate": "2014-05-01",

      "summary": "Pied Piper is a multi-platform technology based on a proprietary universal compression algorithm that has consistently fielded high Weisman Scores™ that are not merely competitive, but approach the theoretical limit of lossless compression.",
      "highlights": [
        "Build an algorithm for artist to detect if their music was violating copy right infringement laws",
        "Successfully won Techcrunch Disrupt",
        "Optimized an algorithm that holds the current world record for Weisman Scores"
      ]
    },
    {
      "company": "LilyPad Solutions",
      "position": "Lead Designer/Front-end Developer",
      "website": "http://lilypad.co",
      "startDate": "2011-07-01",
      "endDate": "2014-05-01",
      "summary": "Joined a group of individuals to design their first app and website. Helped assist the one developer build the iOS app in Titanium Studio on their Javascript platform. Company pivoted to another product; received funding and hired me full-time.",
      "highlights": [
        "LilyPad App - An iPad app to broadcast presentations across multiple devices and encourage user engagement. Designed the entire app which was already set on top of a pre-existing framework.",
        "LilyPad App Website - Designed from wireframe and all of the images on the site (excluding the frog). Teamed up with an illustrator to help create the companies mascot.",
        "LilyPad Sales Mobile App - An outside sales team’s motivational activity driven tool. Worked on branding and style guides for application. Wireframed and prototyped early designs prior to launch. Complete design of entire application and iconography for release on iOS. Converted designs and rebuilt on Android following release of iOS.",
        "LilyPad Sales Web App - Teamed up with the developer to release a dashboard application for managers LilyPad Sales Website - Bootstrap built and designed landing pages along with main company site."
      ]
    },
    {
      "company": "Actsoft",
      "position": "Designer/Front-end Developer",
      "website": "http://actsoft.com",
      "startDate": "2009-01-01",
      "endDate": "2013-02-01",
      "summary": "Dealt with everything web related in a small in-house marketing team at Actsoft. Took on several roles within the small team such as tackling a large amount of the marketing needs from designing and building websites, email marketing campaigns, to helping create a social presence.",
      "highlights": [
        "Actsoft’s Main Site - Built on Wordpress. The entire team worked on this project from the beginning stages of site map creation to final site launch. Was responsible for the user experience and layout of the project. Assisted in implementing the companies first ever Wordpress website and performance optimization.",
        "Advanced Wireless Forms - Cross platform forms app. Designed and built the static marketing website. Dashtrac - Plug & Play vehicle tracking device (Even named product). Designed and built the marketing website."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "University of Tampa",
      "position": "Teacher's Assistant",
      "website": "http://ut.edu/",
      "startDate": "2008-02-01",
      "endDate": "2008-05-01",
      "summary": "Supervised and taught several web design and development classes; while finishing my senior year at UT.",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "University of Tampa",
      "area": "Electronic Media Arts and Technology",
      "studyType": "Bachelor",
      "startDate": "2005-08-01",
      "endDate": "2008-05-01",
      "gpa": "3.3",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Front-end Development",
      "level": "Senior",
      "keywords": [
        "HTML5",
        "CSS3",
        "Sass/Less",
        "Javascript",
        "jQuery",
        "Responsive Development",
        "Markdown",
        "Git"
      ]
    },
    {
      "name": "UI Design",
      "level": "Mid-level",
      "keywords": [
        "Photoshop",
        "Illustrator",
        "Iconography",
        "Interface Design"
      ]
    }
  ],
  "languages": [],
  "interests": [],
  "references": []
}
