{
  "basics": {
    "name": "Dustin Delatore",
    "label": "Frontend Developer",
    "picture": "",
    "email": "dustin@delatore.me",
    "phone": "603.767.0614",
    "website": "https://whosdustin.com",
    "summary": "Over 12 years of web design and 8 years frontend development experience. All of my attention was focused on creating the best user experience possible. Highly motivated, hard working and an ambitious leader prepared for any challenges that confront me.",
    "location": {
      "address": "111 E. Washington St.",
      "postalCode": "FL 32801",
      "city": "Orlando",
      "countryCode": "US",
      "region": "Florida"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "whos_dustin",
        "url": "http://twitter.com/whos_dustin"
      },
      {
        "network": "Github",
        "username": "whosdustin",
        "url": "http://github.com/whosdustin"
      }
    ]
  },
  "work": [
    {
      "company": "Bisk Education",
      "position": "Lead Frontend Developer",
      "website": "http://bisk.com",
      "startDate": "2014-05-01",
      "summary": "Worked on the Bisk Learning Management System (LMS), built on C# MVC using Sass and jQuery. Supported a team in converting the LMS to a fully responsive application. Optimized the frontend of the LMS with thorough research and documentation of development standards. Also, part of the first mobile development team to create Bisk's first mobile application. Later, moved up to the UX team assisting in research and developement of all technology both internal and external.",
      "highlights": [
        "Wrote a frontend development standards documentation",
        "Converted an application to responsive design",
        "Optimized CSS for scalabilty and performance using SMACSS framework",
        "Developed a mobile app for iOS and Android using Titanium",
        "Implemented high speed development process for Marketing Dept. using Yeoman, Jekyll, Sass, Grunt, jQuery, Bootstrap 4, Travis-Ci"
      ]
    },
    {
      "company": "LilyPad Solutions",
      "position": "Designer/Frontend Developer",
      "website": "http://lilypad.co",
      "startDate": "2011-07-01",
      "endDate": "2014-05-01",
      "summary": "Joined a group of individuals to design our first app and marketing site. Helped assist the development of the iOS app in Titanium on their Javascript platform. Company pivoted to another product; received funding and hired me full-time.",
      "highlights": [
        "LilyPad App - An iPad app to broadcast presentations across multiple devices and encourage user engagement. Designed the entire app which was already set on top of a pre-existing framework.",
        "LilyPad App Website - Designed from wireframe and all of the images on the site (excluding the frog). Teamed up with an illustrator to help create the companies mascot.",
        "LilyPad Sales Mobile App - An outside sales team’s motivational activity driven tool. Worked on branding and style guides for application. Wireframed and prototyped early designs prior to launch. Complete design of entire application and iconography for release on iOS. Converted designs and rebuilt on Android following release of iOS.",
        "LilyPad Sales Web App - Teamed up with the developer to release a dashboard application for managers LilyPad Sales Website - Bootstrap built and designed landing pages along with main company site."
      ]
    },
    {
      "company": "Actsoft",
      "position": "Designer/Frontend Developer",
      "website": "http://actsoft.com",
      "startDate": "2009-01-01",
      "endDate": "2013-02-01",
      "summary": "Dealt with everything web related in a small in-house marketing team at Actsoft. Took on several roles within the small team such as tackling a large amount of the marketing needs from designing and building websites, email marketing campaigns, to helping create a social presence.",
      "highlights": [
        "Actsoft’s Main Site - Built on Wordpress. The entire team worked on this project from the beginning stages of site map creation to final site launch. Was responsible for the user experience and layout of the project. Assisted in implementing the companies first ever Wordpress website and performance optimization.",
        "Advanced Wireless Forms - Cross platform forms app. Designed and built the static marketing website. Dashtrac - Plug & Play vehicle tracking device (Even named product). Designed and built the marketing website."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "University of Tampa",
      "position": "Teacher Assistant",
      "website": "http://ut.edu/",
      "startDate": "2008-02-01",
      "endDate": "2008-05-01",
      "summary": "Supervised and taught several web design and development classes; while finishing my senior year at UT.",
      "highlights": []
    }
  ],
  "education": [
    {
      "institution": "University of Tampa",
      "area": "Electronic Media Arts and Technology",
      "studyType": "Bachelor of Arts",
      "startDate": "2005-08-01",
      "endDate": "2008-05-01",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Frontend",
      "level": "Sr-level",
      "keywords": [
        "HTML5",
        "CSS3",
        "SASS",
        "Javascript"
      ]
    },
    {
      "name": "Frameworks",
      "level": "Mid-level",
      "keywords": [
        "jQuery",
        "Bootstrap",
        "BEM",
        "RSCSS",
        "SMACSS"
      ]
    },
    {
      "name": "Backend",
      "level": "Mid-level",
      "keywords": [
        "Node.js",
        "Ruby",
        "Rails"
      ]
    },
    {
      "name": "Cloud",
      "level": "Mid-level",
      "keywords": [
        "AWS",
        "S3",
        "Heroku"
      ]
    },
    {
      "name": "Database",
      "level": "Jr-level",
      "keywords": [
        "Posgresql"
      ]
    },
    {
      "name": "Project Management",
      "level": "Sr-level",
      "keywords": [
        "Trello",
        "Asana",
        "Agile"
      ]
    }
  ],
  "languages": [],
  "interests": [],
  "references": []
}
